trailcurrentoss/TrailCurrentFireside/sdkconfig.defaults
# Waveshare ESP32-P4-WIFI6-Touch-LCD-7B — sdkconfig defaults.
#
# Edit THIS file, never sdkconfig — IDF regenerates sdkconfig on every build
# and any direct edit is silently overwritten.

CONFIG_IDF_TARGET="esp32p4"

# --- Flash — Waveshare board ships with 32MB. ---
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="32MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# --- Experimental-features gate. On ESP32-P4, CONFIG_SPIRAM_SPEED_200M is
#     hidden behind this Kconfig — without it set, the SPIRAM speed option
#     silently falls back to 80 MHz (the next visible choice) and the PSRAM
#     clock ends up much slower than intended. Every LVGL draw buffer + the
#     DPI framebuffer lives in PSRAM, so the bandwidth loss is user-visible
#     (tearing during scroll, longer paint frames on the 1024x600 panel).
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# --- PSRAM — required. LCD framebuffer is ~1.2 MB per buffer (1024x600x2);
#     with no PSRAM, display init returns ESP_ERR_NO_MEM at boot. ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# --- L2 cache geometry — Espressif's recommended P4 config for MIPI-DSI
#     + PSRAM bandwidth.
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# --- Custom partitions (partitions.csv in project root). ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- LVGL color depth: 16-bit RGB565 matches EK79007 panel setup used by
#     the Waveshare BSP. ---
CONFIG_LV_COLOR_DEPTH_16=y

# --- Main task pinned to core 0. lvgl_port task will pin itself to core 1
#     inside bsp_display_start_with_config, giving panel refresh its own core.
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU0=y

# --- sys_evt task stack. ESP-Hosted marshals big wifi_ap_record_t batches
#     on this task; the default 2816 bytes overflows on the first scan-done
#     event. Bump to 6144.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=6144

# --- Internal-RAM reserve + mbedtls in PSRAM.
#     Keeps 128 KB internal available for DMA-critical allocations that
#     can't live in PSRAM. mbedtls (used by mqtts:// TLS) is a big
#     internal-RAM consumer by default; push it to PSRAM.
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=131072
CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC=n
CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC=n
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y

# --- TLS insecure — accept the Headwaters MQTT broker's self-signed cert
#     (LAN-only deployment). mqtt_client.c also sets
#     skip_cert_common_name_check=true so the CN doesn't have to match.
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y

# --- Compiler at -O2 for size/speed. Assertions kept ON. ---
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y

# --- FreeRTOS 1000 Hz tick. ---
CONFIG_FREERTOS_HZ=1000

# --- Task WDT — ui_init() builds ~14 screens with hundreds of widgets and
#     takes ~6.5s on core 0; the default 5s timeout fires during boot.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=15

# --- LVGL memory — use system malloc so LVGL's heap comes from PSRAM. ---
CONFIG_LV_MEM_CUSTOM=y

# --- LVGL refresh period 16 ms (~60fps). ---
CONFIG_LV_DISP_DEF_REFR_PERIOD=16

# --- LVGL indev polling period 10 ms. Waveshare board leaves GT911 INT
#     unconnected (BSP_LCD_TOUCH_INT = GPIO_NUM_NC), so LVGL is in polling
#     mode. 10 ms cadence keeps quick taps from being missed. ---
CONFIG_LV_INDEV_DEF_READ_PERIOD=10

# --- LVGL default theme kept ENABLED. EEZ Studio's C export calls
#     lv_theme_default_init() unconditionally in screens.c; disabling
#     LV_USE_THEME_DEFAULT breaks that call.
CONFIG_LV_USE_THEME_DEFAULT=y

# --- All UI fonts are custom Roboto / FontAwesome via ui_font_*.c files.
#     lv_font_montserrat_14 is still needed as the LVGL library's internal
#     default (theme fallback); other Montserrat sizes stay disabled to
#     keep flash footprint tight.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y

# --- ESP-Hosted WiFi (ESP32-P4 has no native WiFi — bridged to C6 slave).
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y

# --- ESP-Hosted SDIO for Waveshare 7B (default slot 1 pin map — no override
#     needed). CLK=18 CMD=19 D0=14 D1=15 D2=16 D3=17. RESET_SLAVE comes from
#     the ESP-Hosted defaults on this board too.
CONFIG_ESP_HOSTED_P4_DEV_BOARD_NONE=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y

# --- Waveshare BSP: LCD color format & display buffer strategy ---
# 2 = double buffered in the LVGL port (BSP forwards to esp_lvgl_port).
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=2

# Leave WiFi IRAM room for LVGL
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n

# Keep Hosted worker tasks out of internal RAM.
CONFIG_ESP_HOSTED_DFLT_TASK_FROM_SPIRAM=y

# --- ESP-Hosted SDIO buffer pool sizing.
#     Default 20/20 needs (20+11) × 1536 ≈ 47 KB of DMA-capable internal
#     SRAM, allocated in ESP-Hosted's __attribute__((constructor)) before
#     app_main. On this board (256 KB internal SRAM, 128 KB reserved for
#     DMA per CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL) the boot-time linker
#     BSS + startup thread stacks leave the pool alloc barely fitting.
#     Adding another IRAM consumer (fatfs, sdmmc) tips it over into
#     `assert failed: sdio_mempool_create sdio_drv.c:255 (buf_mp_g)` at
#     boot. 12/12 leaves ~30 % headroom, no observable throughput loss on
#     the local MQTT + HTTP traffic this device does.
CONFIG_ESP_HOSTED_SDIO_TX_Q_SIZE=12
CONFIG_ESP_HOSTED_SDIO_RX_Q_SIZE=12

# --- FATFS long file names — required so we can fopen("/sdcard/environment.conf")
#     by its real name. Without LFN, FATFS reports the DOS 8.3 short name
#     (ENVIRO~1.CON) and the open fails.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y
